#ifndef UIGETTABLE_H
#define UIGETTABLE_H
/** @file
 * @brief Содержит Интерфейс получения таблиц
 */

//---------------------------------------------------------------------------
namespace exl {
/** -------------------------------------------------------------------------
 * @brief Интерфейс для получения таблиц
 * @ingroup Interfaces
 * 
 * Отвечает за наличие всевозможных методов получения таблиц.
 * 
 * ---------------------------------------------------------------------- **/
template<class Ttable>
class IGetTable
{
public:
    /// @brief Самый популярный способ
    /// @param tableName Имя таблицы
    /// @return Таблицу или нулевой указатель
    virtual Ttable* GetTable(const String& tableName) = 0;

};

}

//---------------------------------------------------------------------------
#endif // UIGETTABLE_H

